const findElement = require('./findMaxInSequence');

describe('Функция находит максимум в массиве, состоящем из целых чисел, и возвращает его', () => {
  it('Возвращает число 6', () => {
    expect(findElement([2, 4, 3, 2, 5, 6])).toBe(6);
  });
  it('Возвращает 101', () => {
    expect(findElement([100, 0, 20, -10, 5, 101])).toBe(101);
  });
  it('Возвращает число -2', () => {
    expect(findElement([-8, -14, -3, -2, -4])).toBe(-2);
  });
  it('Возвращает число 533811299', () => {
    expect(findElement([533811299, 534, -16536, 617, 89, 20479, 64817])).toBe(533811299);
  });
});
